ahtn/keyplus/ports/efm8/efm8/mcu/EFM8BB1/inc/SI_EFM8BB1_Register_Enums.h
#define REF0CN_IREFLVL__BMASK       0x80 ///< Internal Voltage Reference Level                  
#define REF0CN_IREFLVL__SHIFT       0x07 ///< Internal Voltage Reference Level                  
#define REF0CN_IREFLVL__1P65        0x00 ///< The internal reference operates at 1.65 V nominal.
#define REF0CN_IREFLVL__2P4         0x80 ///< The internal reference operates at 2.4 V nominal. 
                                                                                                
//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator 0 Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_STOPCF__BMASK    0x08 ///< Stop and Shutdown Mode Configuration              
#define REG0CN_STOPCF__SHIFT    0x03 ///< Stop and Shutdown Mode Configuration              
#define REG0CN_STOPCF__ACTIVE   0x00 ///< Regulator is still active in stop mode. Any       
                                     ///< enabled reset source will reset the device.       
#define REG0CN_STOPCF__SHUTDOWN 0x08 ///< Regulator is shut down in stop mode (device enters
                                     ///< Shutdown mode). Only the RSTb pin or power cycle  
                                     ///< can reset the device.                             
                                                                                            
//------------------------------------------------------------------------------
// WDTCN Enums (Watchdog Timer Control @ 0x97)
//------------------------------------------------------------------------------
#define WDTCN_WDTCN__FMASK 0xFF ///< WDT Control
#define WDTCN_WDTCN__SHIFT 0x00 ///< WDT Control
                                                
#endif // SI_EFM8BB1_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

